In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns        # k  k column cha vanera check garne sajilo tarika

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# Renaming our existing columns of the dataframe ... 
# df.columns = ['first name', 'last name', 'email']          # first vanni column lai first name le rename garne vaneko

# Renaming our existing particular columns with partuclar name
df.rename(columns={'first': 'first name', 'last': 'last name', 'email': 'email'}, inplace=True)     # yedi aayeko output lai permanaent garauna chai vani inplace= True ko use garincha ..# old name chai key ko thau ma rakhincha & new name lai chai value ko thau ma rakhincha

In [7]:
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
# sabbai columns ko name lai uppercase ma lageko
# df.columns = [x.upper() for x in df.columns]          # yo line ma x.upper() for loop vitra ko definition part ho ... for x in df.columns vannale dataframe ko harek column ma for loop lagako
df

# sabbai columns ko name lai lowercase ma lageko
df.columns = [x.lower() for x in df.columns]
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
# df.first name               # ERROR : INVALID SYTAX aaucha becasue there is space in the column name # yesari column ko name mai space cha & hamil dot notation ko help batw column lai access garna khojyau vani syntax sahi huda hudai pani invalid syntax vancha
df['first name']              # yesari bracket ko help batw column lai acccess garna khojyo vani chai error aaudaina

0    Corey
1     Jane
2     John
Name: first name, dtype: object

In [10]:
# Removing spaces from the all column's name... because yedi column ko name ma space vayo vani ... hamilai pandas ko kunai kunai method run garda jhamela huna sakcha (i.e df.columnname garera column lai access garna sakidaina .. only df['columnname'] garera matra access garna sakine vayo)..  
df.columns = df.columns.str.replace(' ', '_')           # Dataframe ko sabbi columns ko name ma vayeko space character lai _ character le replace gareko
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

# Updating Data in Rows & Columns (Modifying Data of Dataframe)

In [11]:
# Updating the value of a index or row or a record
df.loc[0] = ['Dhiraj', 'Kafle', 'dhirajkafle@mail.com']
df

  first_name last_name                 email
0     Dhiraj     Kafle  dhirajkafle@mail.com
1       Jane       Doe     JaneDoe@email.com
2       John       Doe     JohnDoe@email.com

In [12]:
# updating value of specific column of a row or a record
df.loc[0, ['last_name', 'email']] = ['Doe', 'JohnDoe@email.com']

In [13]:
df

  first_name last_name              email
0     Dhiraj       Doe  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

In [14]:
df.loc[0, 'first_name'] = 'Corey'

In [15]:
df

  first_name last_name              email
0      Corey       Doe  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

# Use of .at[ ] method for setting value

In [16]:
# Use of .at[] pandas method
# .at[] is used to to get or set a single value of row/column label in a DataFrame or Series.
# setting the value
df.at[0, 'last_name'] = 'Schafer'

In [17]:
df

  first_name last_name              email
0      Corey   Schafer  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

In [18]:
#filt = (df['email'] == 'JohnDoe@email.com')
#df[filt]['last'] = 'Smith'              # yesari filter garear manually value set garna khojda roor aaucha.. so yedi value set garna cha vani.. ki chai .loc[] method ko use garni ki chai .at[] method ko use garne

# Use of .loc[ ] method for setting value

In [19]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last_name'] = 'Doe'          # .loc[] method ko use garera value set gareko
df

  first_name last_name              email
0      Corey       Doe  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

In [20]:
# Updating all values of a column at once
df['email'].str.lower()           # email vanni column ko sabbai values lai lower garayeko
df
# df['email'] = df['email'].str.lower()

  first_name last_name              email
0      Corey       Doe  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

In [21]:
df

  first_name last_name              email
0      Corey       Doe  JohnDoe@email.com
1       Jane       Doe  JaneDoe@email.com
2       John       Doe  JohnDoe@email.com

# Some popular methods in order to change multiple rows at once

# 1) apply ==> it can works on pandas series obect and dataframe 
# 2) map  ==> it only works series object
# 3) applymap ==> it only works on dataframe
# 4) replace   ==>  it can works on pandas series object and dataframe

# apply method working with pandas series object
#  ==> series object ma apply method use garnu vaneko, series object ko sabbai values ma apply method use garnu ho

In [22]:
# email series object ko each value lai len vanni method apply gareko
df['email'].apply(len)

0    17
1    17
2    17
Name: email, dtype: int64

# creating a regular function to use it in apply() method

In [23]:
def update_email(email):        # update_email() vanni hamile banayeko auta custom method ho
    return email.upper()        # pratek email value lai uppercase ma convert garera return garne kaam garcha

In [24]:
# df['email'].apply(update_email)         # yesari apply() garney bittikai hamro dataframe ko column ko value overwrite hudaina  # email column ma update_email vannni method apply gaerko

In [25]:
# df                    # hamro dataframe ko column ko value yo mathi ko apply method le overwrite gareko cha ki nai vanera check gareko

In [26]:
df['email'] = df['email'].apply(update_email)     # Changes lai overwrite garna ko lagi  ==>  left side ma    df['email'] =  lekheko

In [27]:
df          # Finally we are checking hamro changes haru overwrite vayo ki nai vanera

  first_name last_name              email
0      Corey       Doe  JOHNDOE@EMAIL.COM
1       Jane       Doe  JANEDOE@EMAIL.COM
2       John       Doe  JOHNDOE@EMAIL.COM

# Creating a lambda function to use it in apply method
# ==> Note : lambda function always works on series object even though u are apply it in the dataframe object.. i.e dataframe vitra ko each column or each rows chai series object ho

In [28]:
df['email'] = df['email'].apply(lambda x: x.lower())      #  yo line ma lambda chai no name function ani x: chai yo function ma aaune as input values ani x.lower() chai yo lambda function ko definition ho  # lambda function ko help batw email column ko sabbai values lai lower case ma lageko

In [29]:
df

  first_name last_name              email
0      Corey       Doe  johndoe@email.com
1       Jane       Doe  janedoe@email.com
2       John       Doe  johndoe@email.com

In [30]:
len(df['email'])         # pandas series object of kunai auta column ko length nikalnu cha vani len() method ko use garna sakincha

3

# apply method working with pandas dataframe object
#  ==> dataframe object ma apply method use garnu vaneko, dataframe ko each series object (each column or each row) ma apply garnu ho

In [31]:
df.apply(len)         # yesari dataframe ma apply method use garyo vani, by default column wise(axis=0) apply hucha # yedi yesari dataframe ma apply method ko use garyo vani yo chai each column or series object ma apply vai rako cha

first_name    3
last_name     3
email         3
dtype: int64

In [32]:
df.apply(len, axis=0)               # mathi ko and yo same ho.. i.e apply method apply huda default column wise nai apply huncha

first_name    3
last_name     3
email         3
dtype: int64

In [33]:
df.apply(len, axis=1)         #yedi apply method lai row wise apply garnu cha vani we can say axis=1

0    3
1    3
2    3
dtype: int64

In [34]:
df.apply(pd.Series.min)            # yedi dataframe ko each column or series object ko sabai vanda minimun value nikalna cha vani yesari pd.Series.min use garera nikalna sakincha

first_name                Corey
last_name                   Doe
email         janedoe@email.com
dtype: object

In [35]:
df.apply(pd.Series.max)           # yedi dataframe ko each column or series object ko sabai vanda maximun value nikalna cha vani yesari pd.Series.max use garera nikalna sakincha

first_name                 John
last_name                   Doe
email         johndoe@email.com
dtype: object

In [36]:
df.apply(lambda x: x.min())         # Note : lambda function always works on series object i.e dataframe ma apply gare pani dataframe ko each column i.e series object ma nai apply huncha

first_name                Corey
last_name                   Doe
email         janedoe@email.com
dtype: object

#  applymap()

# ==>it only works on dataframe not on series object (i.e dataframe ko pani each value ma apply huncha not on the each column or each row)

In [37]:
df.applymap(len)            # apply len function to each individual value(element) of our dataframe

   first_name  last_name  email
0           5          3     17
1           4          3     17
2           4          3     17

In [38]:
df.applymap(str.lower)     # note : yedi tmro dataframe ko sabbai values haru string type ko cha vani error aaudaina.. haina vani yedi numeric khalko values cha vani error aaucha  # all of the values of dataframe lower case ma lagaeko

  first_name last_name              email
0      corey       doe  johndoe@email.com
1       jane       doe  janedoe@email.com
2       john       doe  johndoe@email.com

# map() method 
#   ==> it only works on seires object

In [39]:
df['first_name'].map({'Corey': 'Chris', 'Jane': 'Mary'})         # series object ko value lai substitue garna lageko

0    Chris
1     Mary
2      NaN
Name: first_name, dtype: object

In [40]:
df

  first_name last_name              email
0      Corey       Doe  johndoe@email.com
1       Jane       Doe  janedoe@email.com
2       John       Doe  johndoe@email.com

#  replace method
#  ==> it can be applied to both series object and dataframe

In [41]:
df['first_name'] = df['first_name'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [42]:
df

  first_name last_name              email
0      Chris       Doe  johndoe@email.com
1       Mary       Doe  janedoe@email.com
2       John       Doe  johndoe@email.com

In [43]:
# df.replace({'Corey': 'Dhiraj', 'Mary': 'Harry'}) 
df = df.replace({'Chris': 'Dhiraj', 'Mary': 'Harry'})       # overwriting the changes to the dataframe

In [44]:
df

  first_name last_name              email
0     Dhiraj       Doe  johndoe@email.com
1      Harry       Doe  janedoe@email.com
2       John       Doe  johndoe@email.com

In [45]:
df.replace(to_replace =["Hary", "John"], value =["Khyari", "Khon"]) # yo code & mathi ko code samyo.. mathi ko dictionary batw replace garne wala chai sajilo cha yo vanda

  first_name last_name              email
0     Dhiraj       Doe  johndoe@email.com
1      Harry       Doe  janedoe@email.com
2       Khon       Doe  johndoe@email.com

In [46]:
df      # since yo vanda mathi ko cell ma hamile replace tw garyau but hamile gareko changes lai overwrite garenau so ahile dataframe herda kei pani replace nai navako jasto dekincha

  first_name last_name              email
0     Dhiraj       Doe  johndoe@email.com
1      Harry       Doe  janedoe@email.com
2       John       Doe  johndoe@email.com